Pandas

Pandas Series

A series is a one-dimensional labeled  array capable of holding any data type. The axis labels are collectively called the index.

Creating Series

There are multiple way to create a pandas Series :

In [2]:
!pip install pandas numpy

Requirement already satisfied: pandas in /home/lakshya/anaconda3/lib/python3.11/site-packages (2.2.1)
Requirement already satisfied: numpy in /home/lakshya/anaconda3/lib/python3.11/site-packages (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/lakshya/anaconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/lakshya/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.7 in /home/lakshya/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /home/lakshya/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [5]:

import numpy as np
import pandas as pd

In [6]:
labels = ['a', 'b', 'c', 'd']
my_list = [10, 20, 30, 40]
arr = np.array([10, 20, 30, 40])
d = {1:10, 2:20, 3:30, 4:40}

In [7]:
pd.Series(my_list)

0    10
1    20
2    30
3    40
dtype: int64

In [8]:
pd.Series(my_list, index=labels)  # Series from list with custom index

a    10
b    20
c    30
d    40
dtype: int64

In [9]:
#Creating Series from NumPy array
pd.Series(arr, index=labels)  # Series from NumPy array with custom index

a    10
b    20
c    30
d    40
dtype: int64

In [10]:
# Series from Dictionary
pd.Series(d)  # Series from dictionary with default index

1    10
2    20
3    30
4    40
dtype: int64

DataFrame

When two or more series joins together it made DataFrame...

Creating a Dataframe

In [38]:
# When two or more series joins together it made DataFrame...

data = {
    'Name' : ['John','Anna','Peter','Linda'],
    'Age': [28,34,29,42],
    'City': ['New York','Paris','Berlin','London'],
    'Salary': [65000,70000,62000,85000]
}

df = pd.DataFrame(data)  # Creating DataFrame from dictionary

In [39]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [40]:
# Creating a Dataframe using a list of lists

data_lists = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]

df2 = pd.DataFrame(data_lists)
columns = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_lists, columns=columns)  # Creating DataFrame from list of lists with column names

In [41]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [42]:
df2['Name'] # Accessing the 'Name' column

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [43]:
df2[['Name',"City"]] # Accessing multiple columns

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

Creating a Column

In [44]:
# Adding a new column to the DataFrame 

df2['Designation'] = ['Engineer', 'Designer', 'Manager', 'Analyst']  # Adding a new column
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000    Engineer
1   Anna   34     Paris   70000    Designer
2  Peter   29    Berlin   62000     Manager
3  Linda   42    London   85000     Analyst

Removing a Column in DataFrame

In [45]:
df2.drop('Designation', axis=1, inplace=True)  # Removing the 'Designation' column
# inplace=True modifies the original DataFrame without creating a new one
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [46]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

Removiing Multiple Column

In [48]:
df2.drop(['Age', 'City'], axis=1)  # Removing multiple columns

    Name  Salary
0   John   65000
1   Anna   70000
2  Peter   62000
3  Linda   85000

Removing Row

In [49]:
df2.drop(0,axis=0, inplace=True)  # Removing the first row
df2  # Displaying the DataFrame after removing the row

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

Selecting a Row

In [50]:
df2

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

In [55]:
df2.loc[[1,3]]  # Selecting the second row using .loc

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [56]:
df2.iloc[1]  # Selecting the second row using .iloc

Name       Peter
Age           29
City      Berlin
Salary     62000
Name: 2, dtype: object

Selecting the subset of Rows and Columns